Revit 2024 API
Speckle Members
The Speckle type exposes the following members.
Properties
Name | Description
SpeckleColor1
 The property labeled "Color 1" from the "Speckle" schema.
SpeckleColor2
 The property labeled "Color 2" from the "Speckle" schema.
SpeckleSize
 The property labeled "Size" from the "Speckle" schema.
TextureAngle
 The property labeled "Angle" from the "Speckle" schema.
TextureLinkTextureTransforms
 The property labeled "Link Transforms" from the "Speckle" schema.
TextureRealWorldOffsetX
 The property labeled "Offset X" from the "Speckle" schema.
TextureRealWorldOffsetY
 The property labeled "Offset Y" from the "Speckle" schema.
TextureRealWorldOffsetZ
 The property labeled "Offset Z" from the "Speckle" schema.
See Also
Speckle Class
Autodesk.Revit.DB.Visual Namespace